const postResFunc = (req, res) => {
  let messages = [
    "Ви чудова людина, завжди прийдете на допомогу своїм близьким і не відмовите незнайомцю в біді. Проте не забувайте виділяти час на себе і вчіться говорити ні. Ваш тип особистості -- Руденький цуцик.",
    "Ви дуже цікава людина. Справжній лідер, не всім подобаєтесь через свою принциповість, але у всіх викликаєте повагу. Навчіться іноді поступатись -- це зменшить ваш рівеньтривожності та покращить самопочуття. Ваш тип особистості -- Кіт звичайний.",
    "Ви прекрасна людина. Заради рідних ви готові на все, завжди дивитесь уперед і з легкістю долаєте перешкоди.Не втрачайте настрою і не давайте сумнівам взяти гору. Ваш тип особистості -- Кіт оптимістичний.",
    "Ви досить цікава людина. Не завжди Вас легко зрозуміти, але на кожну Вашу дію є вагомий аргумент. Ви не ділитесь сокровенним з першим ліпшим, але завжди щирі з людьми, які заслужили вашу довіру. Будьте більш відкритими і не думайте, що навколо чигає небезпека. Ваш тип особистості -- Чорненький цуцик.",
    "Ви суперова людина. Ви не соромитесь проявляти емоції, бути відкритими та не ідеальними -- цим ви приваблюєте людей. Не втрачайте своєї щирості -- саме вона приведе Вас до успіху. Ваш тип особистості -- Жабка.",
    "Ви незвичайна людина. Ви залишаєте слід у житті всіх людей, з якими спілкуєтесь, Ваша харизма неповторна -- тому люди тягнуться до Вас. Не забувайте, що слова можуть ранити інших і будьте обережнішими у своїх висловлюваннях. Ваш тип особистості -- Кентозавр.",
  ];
  let n = Math.floor(Math.random() * messages.length);

  let resMessage = messages[n];

  res.render("results", { resMessage });
};

module.exports = { postResFunc };
